{
  "General": {
    "icon": "Help",
    "questions": [
      "Why do you want to work for X company?",
      "Why do you want to leave your current/last company?",
      "What are you looking for in your next role?",
      "Tell me about a time when you had a conflict with a co-worker.",
      "Tell me about a time in which you had a conflict and needed to influence somebody else.",
      "What project are you currently working on?",
      "What is the most challenging aspect of your current project?",
      "How do you tackle challenges? Name a difficult challenge you faced while working on a project, how you overcame it, and what you learned.",
      "What are you excited about?",
      "What frustrates you?",
      "Imagine it is your first day here at the company. What do you want to work on?",
      "What are the most interesting projects you have worked on and how might they be relevant to this company's environment?",
      "Tell me about a time you had a disagreement with your manager.",
      "Talk about a project you are most passionate about, or one where you did your best work.",
      "What does your best day of work look like?",
      "What is something that you had to push for in your previous projects?",
      "What is the most constructive feedback you have received in your career?",
      "What is something you had to persevere at for multiple months?",
      "Tell me about a time you met a tight deadline.",
      "If this were your first annual review with our company, what would I be telling you right now?",
      "Time management has become a necessary factor in productivity. Give an example of a time-management skill you've learned and applied at work.",
      "Tell me about a problem you've had getting along with a work associate.",
      "What aspects of your work are most often criticized?",
      "How have you handled criticism of your work?",
      "What strengths do you think are most important for your job position?",
      "What words would your colleagues use to describe you?",
      "What would you hope to achieve in the first six months after being hired?",
      "Tell me why you will be a good fit for the position."
    ]
  },
  "SWE": {
    "icon": "Code",
    "questions": [
      "Describe a challenging bug you've encountered and how you solved it.",
      "How would you design a scalable system for a social media platform?",
      "Tell me about a time when you improved the performance of an application.",
      "Describe a situation where you had to optimize a database query.",
      "Can you give an example of a time when you had to refactor a large codebase? What was your approach?",
      "How do you ensure your code is maintainable?",
      "Tell me about a time when you had to implement a new feature under a tight deadline.",
      "Describe a project where you had to collaborate with other teams. How did you ensure effective communication?",
      "How have you handled a situation where you disagreed with a team member on a technical solution?",
      "Describe a time when you had to mentor or help a less experienced team member.",
      "How do you approach learning a new technology or programming language?",
      "Give an example of a time when you had to troubleshoot a production issue.",
      "Describe a situation where you had to balance technical debt with the need to deliver a project on time.",
      "How do you approach writing unit tests for your code?",
      "Tell me about a time when you had to work with legacy code. How did you manage it?",
      "Describe a project where you had to use a technology or tool that was new to you.",
      "Can you give an example of how you've used version control in your projects?",
      "How do you stay up to date with the latest developments in software engineering?",
      "Describe a time when you had to handle conflicting priorities in a project.",
      "Tell me about a situation where you had to gather and understand user requirements.",
      "How do you handle code reviews, both giving and receiving feedback?",
      "Describe a time when you had to ensure the security of an application.",
      "How do you manage and resolve merge conflicts in version control?",
      "Give an example of a time when you had to debug a performance issue in an application.",
      "Describe a project where you had to integrate multiple third-party services.",
      "How do you approach designing RESTful APIs?",
      "Tell me about a time when you had to work with a remote team.",
      "Describe a situation where you had to handle a significant change in project scope.",
      "How do you approach writing documentation for your code and projects?",
      "Tell me about a time when you had to work with a difficult stakeholder.",
      "How do you ensure your code is scalable?",
      "Describe a situation where you had to migrate data from one system to another.",
      "How do you handle technical challenges that you don't immediately know how to solve?",
      "Tell me about a project where you had to use Agile methodologies.",
      "Describe a time when you had to balance writing clean code with meeting a tight deadline.",
      "How do you approach continuous integration and continuous deployment (CI/CD)?",
      "Tell me about a time when you had to deal with a critical bug in production.",
      "Describe a situation where you had to use data structures and algorithms to solve a problem.",
      "How do you handle feedback from code reviews?",
      "Tell me about a time when you had to implement a microservices architecture.",
      "Describe a project where you had to handle large amounts of data.",
      "How do you ensure the reliability of your applications?",
      "Tell me about a time when you had to work with a new team and adapt to their coding standards.",
      "Describe a situation where you had to implement a caching strategy.",
      "How do you approach improving the user experience in your applications?",
      "Tell me about a time when you had to implement automated testing.",
      "Describe a project where you had to ensure the application could handle high traffic loads.",
      "How do you approach debugging and troubleshooting issues in your code?",
      "Tell me about a time when you had to design a system from scratch.",
      "Describe a situation where you had to implement continuous monitoring for an application."
    ]
  },
  "Consulting": {
    "icon": "BusinessCenter",
    "questions": [
      "Describe a challenging client project you've worked on and how you handled it.",
      "How would you approach a project where a client is experiencing declining market share?",
      "Tell me about a time when you had to analyze a large set of data to make a recommendation.",
      "Describe a situation where you had to manage conflicting priorities for a client.",
      "How would you help a retail client increase their online sales?",
      "Describe a time when you had to present complex information to a client in a simple way.",
      "How would you approach a case where a client wants to enter a new market?",
      "Tell me about a time when you had to convince a client to change their strategy.",
      "How would you help a client reduce their operating costs?",
      "Describe a situation where you had to work with a difficult client.",
      "How would you approach a case where a client is considering a merger or acquisition?",
      "Tell me about a time when you had to work on a tight deadline for a client project.",
      "How would you help a client improve their customer satisfaction scores?",
      "Describe a project where you had to work with multiple stakeholders.",
      "How would you approach a case where a client is facing a crisis situation?",
      "Tell me about a time when you had to develop a strategic plan for a client.",
      "How would you help a client streamline their supply chain?",
      "Describe a situation where you had to gather and analyze market research for a client.",
      "How would you approach a case where a client is facing increased competition?",
      "Tell me about a time when you had to lead a team on a client project.",
      "How would you help a client improve their product development process?",
      "Describe a situation where you had to identify and solve a client's key business problem.",
      "How would you approach a case where a client wants to increase their profitability?",
      "Tell me about a time when you had to handle a significant change in a client project scope.",
      "How would you help a client develop a digital transformation strategy?",
      "Describe a situation where you had to work with a remote team on a client project.",
      "How would you approach a case where a client is considering outsourcing a business function?",
      "Tell me about a time when you had to deliver bad news to a client.",
      "How would you help a client with their go-to-market strategy for a new product?",
      "Describe a situation where you had to use data to support a recommendation to a client.",
      "How would you approach a case where a client is experiencing high employee turnover?",
      "Tell me about a time when you had to manage a client’s expectations.",
      "How would you help a client improve their organizational efficiency?",
      "Describe a situation where you had to analyze a client's financial statements.",
      "How would you approach a case where a client wants to expand their business internationally?",
      "Tell me about a time when you had to work with a cross-functional team on a client project.",
      "How would you help a client with their branding and marketing strategy?",
      "Describe a situation where you had to develop a risk management plan for a client.",
      "How would you approach a case where a client is facing regulatory challenges?",
      "Tell me about a time when you had to create a detailed project plan for a client.",
      "How would you help a client improve their sales performance?",
      "Describe a situation where you had to negotiate with a client.",
      "How would you approach a case where a client is considering a new business model?",
      "Tell me about a time when you had to conduct a competitive analysis for a client.",
      "How would you help a client with their innovation strategy?",
      "Describe a situation where you had to facilitate a workshop or meeting for a client.",
      "How would you approach a case where a client needs to improve their customer service?",
      "Tell me about a time when you had to solve a complex problem for a client.",
      "How would you help a client with their cost-cutting initiatives?",
      "Describe a situation where you had to provide strategic advice to a senior client executive."
    ]
  },
  "Investment Banking": {
    "icon": "AccountBalance",
    "questions": [
      "Describe a time when you analyzed a company's financial statements. What was your approach?",
      "How do you evaluate a company's valuation?",
      "Tell me about a time when you had to work on a financial model under a tight deadline.",
      "Describe a situation where you identified a potential investment opportunity.",
      "How do you stay current with market trends and financial news?",
      "Explain a time when you had to present a financial analysis to a client or senior management.",
      "Describe a project where you had to use Excel for complex financial analysis.",
      "How would you approach valuing a startup company with little historical data?",
      "Tell me about a time when you had to work long hours to complete a deal.",
      "Describe a situation where you had to assess the financial health of a company.",
      "How do you approach analyzing a company's balance sheet?",
      "Tell me about a time when you had to perform a discounted cash flow (DCF) analysis.",
      "Describe a situation where you had to advise a client on a merger or acquisition.",
      "How do you handle working under pressure in high-stakes situations?",
      "Tell me about a time when you identified a risk in a financial transaction and how you mitigated it.",
      "Describe a situation where you had to evaluate the financial impact of a strategic decision.",
      "How do you approach analyzing a company's income statement?",
      "Tell me about a time when you had to work with a team to complete a financial transaction.",
      "Describe a project where you had to perform a comparable company analysis.",
      "How do you ensure the accuracy of your financial models?",
      "Tell me about a time when you had to create a pitch book for a potential deal.",
      "Describe a situation where you had to evaluate a company's capital structure.",
      "How do you handle conflicting priorities when working on multiple deals?",
      "Tell me about a time when you had to negotiate terms in a financial transaction.",
      "Describe a situation where you had to provide strategic financial advice to a client.",
      "How do you approach analyzing a company's cash flow statement?",
      "Tell me about a time when you had to work with different departments to complete a transaction.",
      "Describe a situation where you had to use financial ratios to assess a company's performance.",
      "How do you approach performing a leveraged buyout (LBO) analysis?",
      "Tell me about a time when you had to identify and analyze market trends for a client.",
      "Describe a situation where you had to build a financial model from scratch.",
      "How do you handle tight deadlines and high expectations in investment banking?",
      "Tell me about a time when you had to evaluate the financial viability of a project.",
      "Describe a situation where you had to use financial metrics to make a recommendation.",
      "How do you approach analyzing the financial performance of a competitor?",
      "Tell me about a time when you had to explain complex financial concepts to a non-financial audience.",
      "Describe a situation where you had to assess the financial impact of regulatory changes.",
      "How do you stay organized when managing multiple financial analyses?",
      "Tell me about a time when you had to evaluate the creditworthiness of a company.",
      "Describe a project where you had to perform sensitivity analysis on financial projections.",
      "How do you approach analyzing a company's profitability?",
      "Tell me about a time when you had to work on a cross-border transaction.",
      "Describe a situation where you had to advise a client on raising capital.",
      "How do you handle unexpected challenges during a financial transaction?",
      "Tell me about a time when you had to assess the financial impact of a potential merger.",
      "Describe a situation where you had to analyze a company's debt structure.",
      "How do you approach performing due diligence for a potential investment?",
      "Tell me about a time when you had to create a detailed financial report for senior management.",
      "Describe a situation where you had to evaluate the financial performance of a subsidiary.",
      "How do you handle the pressure of working on high-profile deals?",
      "Walk me through a discounted cash flow (DCF) analysis.",
      "How do you calculate the cost of equity?",
      "Explain the differences between enterprise value and equity value.",
      "What are the main valuation methods you would use to value a company?",
      "How do you calculate free cash flow (FCF)?",
      "What are the key differences between EBIT and EBITDA?",
      "Explain the process of a leveraged buyout (LBO) and its key components.",
      "How do you perform a comparable company analysis?",
      "What is the purpose of sensitivity analysis in financial modeling?",
      "How do you calculate the terminal value in a DCF model?",
      "Describe how you would value a company with negative earnings.",
      "Explain the difference between accretion and dilution in an M&A deal.",
      "What is the weighted average cost of capital (WACC) and how do you calculate it?",
      "How do you approach building a financial model from scratch?",
      "Describe the key steps in performing a merger model.",
      "What is the purpose of a cash flow statement and how is it structured?",
      "Explain the difference between market value and book value.",
      "How do you calculate the internal rate of return (IRR)?",
      "Describe the process of conducting due diligence in an M&A transaction.",
      "What is the significance of the price-to-earnings (P/E) ratio?",
      "How do you value a private company?",
      "Explain the concept of beta in the context of finance.",
      "What are the key assumptions in an LBO model?",
      "How do you calculate net present value (NPV)?",
      "What are the primary components of a balance sheet?",
      "Describe the difference between equity financing and debt financing.",
      "How do you calculate and interpret the current ratio?",
      "Explain the impact of changes in working capital on cash flow.",
      "What is the purpose of a sensitivity analysis in a financial model?",
      "How do you perform a precedent transaction analysis?"
    ]
  },
  "Product Management": {
    "icon": "Inventory",
    "questions": [
      "Describe a product you have managed from concept to launch. What was the process?",
      "How do you prioritize features for a new product?",
      "Explain how you would conduct market research for a new product.",
      "How do you gather and incorporate user feedback into the product development process?",
      "Describe a situation where you had to balance competing priorities.",
      "How do you define the success metrics for a product?",
      "Explain your approach to creating a product roadmap.",
      "How do you handle scope creep in a project?",
      "Describe a time when you had to make a difficult trade-off decision.",
      "How do you ensure alignment between product, engineering, and design teams?",
      "What methods do you use to validate a product idea?",
      "Explain how you would handle a situation where a key feature is delayed.",
      "How do you approach writing product requirements documents (PRDs)?",
      "Describe a time when you had to pivot your product strategy.",
      "How do you approach user segmentation and persona development?",
      "Explain how you would use A/B testing to optimize a product feature.",
      "Describe your experience with agile development methodologies.",
      "How do you balance short-term goals with long-term product vision?",
      "Explain how you would manage stakeholder expectations.",
      "How do you approach competitive analysis?",
      "Describe a situation where you used data to make a product decision.",
      "How do you determine the minimum viable product (MVP) for a new feature?",
      "Explain how you would gather and analyze user behavior data.",
      "Describe your experience with user story mapping.",
      "How do you approach writing user stories and acceptance criteria?",
      "Explain the importance of product lifecycle management.",
      "How do you ensure product quality throughout the development process?",
      "Describe a time when you had to manage a product backlog.",
      "How do you handle negative user feedback?",
      "Explain how you would use customer journey mapping in product development.",
      "Describe a situation where you had to work with cross-functional teams.",
      "How do you measure the impact of a product launch?",
      "Explain your approach to setting and tracking key performance indicators (KPIs).",
      "How do you handle feature requests from stakeholders?",
      "Describe your experience with product analytics tools.",
      "How do you approach creating a go-to-market strategy?",
      "Explain how you would use user testing to validate a product concept.",
      "Describe a time when you had to work with limited resources.",
      "How do you approach managing technical debt?",
      "Explain the role of user experience (UX) in product management.",
      "Describe a situation where you had to make a data-driven decision.",
      "How do you approach setting product pricing?",
      "Explain how you would handle a situation where a competitor launches a similar product.",
      "Describe your experience with product iteration and continuous improvement.",
      "How do you ensure that your product meets regulatory and compliance requirements?",
      "Explain your approach to developing a product vision and strategy.",
      "Describe a time when you had to manage a product through a significant change.",
      "How do you approach integrating feedback from multiple stakeholders?",
      "Explain how you would use customer feedback to drive product innovation.",
      "Describe your experience with launching a product in a new market."
    ]
  }
}
